
{
    "_comment": "Since there is no .comments feature in json, I remind you to read the documentation in the index.html file or in .md! Otherwise, the website will not function properly.",
    
  "webname": "nOtFuN v.2.¹,∅",
  "subname1": "The cleanest, lightweight, and simple web-biodata template",
  "content":"<br><p>Want to have a cool personal website to showcase your projects? This application is the solution! In addition to being able to use it to create an attractive biodata, you can also use this template for your personal website too! </p> <br> <h2> Documentation </h2> <br> <p> With this guide, you will learn how to change the look and feel of your own website. </p> <br> <h3> Understanding website structure </h3> <br> <p> The data.json file is the heart of your website. It contains all the information needed to display content on each page. This file is structured in a way that's easy to understand and edit, even for those who are new to coding., </p> <br> <p> • webname: This is the main title of your website, which appears in the browser tab or at the top of the page. </p> <br> <p> • subname1, subname2, ...: These are the titles for each section (page) of your website. For instance, subname1 is the title for the first page (usually the homepage). </p> <br> <p> • content, project, introduction, attribution: These are columns that hold the actual content for each section. You can input text, arrays (for lists), or objects (for more complex data structures) into these columns. </p> <br> <h3> Further customization </h3> <br> <p> • Formatting Text: Use HTML tags, and others to format your text. You can also use CSS to style text and other elements. </p> <br> <p> • Adding Images: Use the <img> tag to add images to your page. Make sure the path to your image is correct. </p> <br> <p> • Creating Links: Use the <a> tag to create links to other pages or external websites. </p> <br> <p> Adding Forms: You can add contact forms or registration forms using the <form> tag. </p> <br> <h3> Additional Tips </h3> <p>  Ensure your data.json file has correct syntax. You can use an online JSON validator to check. </p> <br> <p> Always create a backup of your data.json file before making significant changes. </p> <br> <p> Understanding the basics of HTML, CSS, and JavaScript allows you to create more dynamic and interactive websites. </p> <br> <h3> Conclusion </h3> <br> <p> By understanding the structure of the data.json file and utilizing HTML features, you can easily create a website that meets your needs. Don't hesitate to experiment and try new things! </p>",
  
  "subname2": "Project History",
  "project": "<center><p style='background: #fff; border: 2px solid #4070F4; border-radius: 5px; box-shadow: 0 4px 8px rgba(0, 0, 0, 0.1); color: black; padding: 10px;'>Nothing you can see here, I promise..</p></center>",
  
  "subname3": "About Me",
  "introduction": "<div style='background: #fff; border: 2px solid #4070F4; border-radius: 5px; box-shadow: 0 4px 8px rgba(0, 0, 0, 0.1); color: black; padding: 10px;'><center><i class='bx bx-phone bx-lg'></i><br><p>Hi! My name is nOtFuN. I am an open source project with a clean, light and fast interface. I am available for free and open-source on the github platform. you can visit me anytime if you need me as a template for a project/application or just for a regular web-biodata. If you have any suggestions regarding this project, you can open the commit on github >_< </p></center></div>",
  "subname4": "Attribution",
  "attribution": "<h2>Boxicons</h2> <br> The icons used in this app are provided by Boxicons and licensed under the MIT license (Copyright (c) 2015-2021 Aniket Suvarna). See <a href='boxicons.com'>https://boxicons.com</a> for more information.<br> <br> <h2> Poppins - Google Fonts </h2> <br> Copyright 2020 <br> The Poppins Project Authors (https://github.com/itfoundry/Poppins) <br> This Font Software is licensed under the SIL Open Font License, Version 1.1 . This license is copied below, and is also available with a FAQ at: <a href='openfontlicense.org'>https://openfontlicense.org</a> <br><br>SIL OPEN FONT LICENSE Version 1.1 - 26 February 2007 <br> <br> <h2>nOtFuN</h2> <br> This project is licensed under the MIT license, read the license below for more details. <br> <br> Copyright (c) 2024-2029 Naipan Abdinegara <br> <br> Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the 'Software'), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions: <br> <br> The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software. <br> <br>THE SOFTWARE IS PROVIDED 'AS IS', WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE."
}
